program prog_8_3;
uses crt;

var
    CurHour: Integer;
    CurHeight: Integer;
    DefaultDelay: Integer;
    name: string;

begin
    // Инициализация
    DefaultDelay:=800;
    CurHour := 0;
    CurHeight := 0;
    Window(1,1,100,100);
    Writeln('                         Добро пожаловать на ЭВЕРЕСТ');
    writeln();
    delay(DefaultDelay);
    textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%/'); textcolor(15);write(',,*//(('); textcolor(lightblue);write('#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%%%%%%'); textcolor(15);write('(#(.*.,...,.*((#'); textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%%%%%'); textcolor(15);write('(#(**,,**#(*,,*//.,,*##'); textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%%'); textcolor(15);write('@&@&**/#/,*#.***.,,,../,*((('); textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%'); textcolor(15);write('##,,(#&((,*..,/*/(*,..,%(/((((('); textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%%'); textcolor(15);write('##@&%%(*./&((((/...,.*/**..,#,*//((((#'); textcolor(lightblue);write('%%%%%%%%%%%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%%%%%'); textcolor(15);write('((((@&(&@@@&..,.*(%#*.,**,....*. ..,*////(((#'); textcolor(lightblue);write('%%%%%%%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%%%'); textcolor(15);write('((#&%(%#(@@&@(*../*..(.../,**/@#(/*.*... ,**//((((((#'); textcolor(lightblue);write('%%%%%%%%%');writeln();
    textcolor(lightblue);write('%%%%%%%%%%%%%'); textcolor(15);write('(((&&&/*(&@@@(@..,.***.. */(,,*(////&.,,./*.///(((((((((((((((((');writeln();
    textcolor(lightblue);write('%%%%%%%%%....'); textcolor(15);write('*(@&(//&/*/%@&///....%%(//,*,,*,*////#//.,,*,*//((((((((((((((((');writeln();
    textcolor(lightblue);write('%,,,....   '); textcolor(15);write('&/&%#%*/**(@&@(%#%@,**//.,((/@@*(//#*###(@(/((@//,#//(((((((((((((');;writeln();
    textcolor(lightblue);write(',******,,,'); textcolor(15);write('&&*/,**/&&&&%&%(#%.**/*((*/@#%(//%#(/(/*(&////#../((/////(/////////');;writeln();
    textcolor(lightblue);write(',**,,,,,'); textcolor(15);write('#*@/(*,,/,*(%&/&/*/&&(/*#(,,,***,/@/(*&&/////#(/*(/**,///////////////');;writeln();
    textcolor(lightblue);write('****,,,'); textcolor(15);write('#%**,*(/##(%*/&@&&&@@&(&,*///.&&/(/,*(,*/,,%/***/*//*/*///(,*#////////');;writeln();
    textcolor(lightblue);write('****%'); textcolor(15);write('((%%&%%@/#@#%@&%#&&@(#(&(%%#&/%(*&%(,*#/,,*/*,#,**,*,***#/#,/(/*///,/*/*');;writeln();
    writeln('*#@@**&&&@&/&(@@&@&&&&@&%@@&/%%&((@@%,*/#/**((,/********,,*,&/*/,//*&%...*%#*');
    writeln('&&*,/&@&&&&@&&%&%&&@&&&&%%(,,*%,&&@@&&&@&/%./%&&&/**,.*/#/*#/*(@@(**/*@(&&(%%');
    writeln('@&&&&@&%&&&&%&%&&&%#(*,,*//@&@%@&@@@&&&%&%#,%%/** /,*((*(/@%&%//**/,*&@&&/*/*');
    writeln('&@&&@&&@&%&%%&%(#&%%*%%*,,,&@@@@@@@@&%&@@@@&&@*,*,.(*,/@%(/%@&/@#*/@@%&@&%/#%');
    writeln('&%(&@@&@&@@@@&&&&,*(//*,&*,/(&&@@%&@&&&&@&@&@@##@@.*(*.#...&/,@@@&@&&@&&*&&@&');
    writeln('@@&@@@@&&@@&&&&@&%&&@&&&&&&,/*(%&@@@&@&%%@&@%%@@&&@%**%%,*.%((#&@@@##/,,*//(/');
    writeln('&@@@@@@@&&@@@@&&&&&%&&@&&%@@@&%&&@&&@@@@&&%&&&&@@&@@&@@@&%/(%*&&&&(/(@&@/(/*,');
    writeln();
    delay(DefaultDelay);
    writeln('Нажмите ENTER');
    readln();
    ClrScr;

    writeln('Джомолунгма, Эверест, Сагарматха...');
    delay(DefaultDelay);
    writeln();
    writeln('Как много имен у этой неприступной красавицы, овеваемой столь сильными ветрами,');
    delay(DefaultDelay);
    writeln();
    writeln('что лишь немногие снежинки сумели задержаться на ее оледенелых каменистых склонах.');
    delay(DefaultDelay);
    writeln();
    writeln('Истинная жемчужина Гималаев, в погоне за которой сгинул не один опытный альпинист.');
    delay(DefaultDelay);
    writeln();
    writeln('Но оставим лирику, ведь ты не за этим пришел сюда, не так ли?');
    delay(DefaultDelay);
    writeln();
    writeln('Лишь одно гложет твой разум при взгляде на эти совершенные 8848 м.');
    delay(DefaultDelay);
    writeln();
    writeln('Покорить ее, оставить след своего ледоступа на Вершине Мира. ');
    delay(DefaultDelay);
    writeln();
    writeln('И цель эта так обманчиво близка...');
    delay(DefaultDelay);
    writeln();
    writeln();
    writeln('Нажмите ENTER');
    readln();
    ClrScr;

    writeln('Можно было бы попросить тебя представиться, но стоит ли Эвересту тебя запоминать?');
    delay(DefaultDelay);
    writeln();
    writeln('Вас каждый год десятки новых.');
    readln();
    ClrScr;

    while (CurHour < 12) and (CurHeight < 800)  do
    begin
    writeln('Текущая высота = ', CurHeight, ' м');
    writeln('Текущее время = ', CurHour, ' ч');

    // Обработка случайного события
    writeln('Все ок');

    // Выбор действия
    writeln('Нажмите Enter');
    readln();

    // Обработка действия
    CurHeight:=CurHeight+200;
    CurHour:=CurHour+1;

    end;

    if (CurHeight >= 800) then
    begin
        ClrScr;
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~::::');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~:::');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~::');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~:');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~~~~~=====~==~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~~========++++=+===~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~==+++++?????IIII+I?++=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~==+++??IIIII=:+?I 7=7+I??==~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~===+++++III7~+~+:=,I7++=7~~?~~=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~=======+++?II+~~~~==::~=:==~?~:+I7?+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~======+++???I:~?I??I:~7,+~~+=+::+:=~7~=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~=======+??IIII+III?I::==~~::=7=+7:I,I,?~~~+=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('==========+III++?+~:~+:+=?=77=III=77777++=:~:~::?~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('=======+=+?I::::::::::+,?=7++:+7:7?7::I=:~=~~~+==:~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('====+==+I?~:~:~~:::::?:~:~I~?~7 I7?+I:I~=:~:++:::=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('===++?~:=++~+:~:~~:I::~::~:::,,+=+:==:~+::~:?:=,~:=::~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('==+?+::+::~::?:~::~=:~~,:=~,:7?++~:~:=:~:~=~==:77II?=+==~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('=?=:::~~:::::::?~::~:~~~:~I=~+?,:::+=~:~:~:::~77II7++I:~?~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('I7:~:~~~:~=~:::?::~~~~?:~:~:~+:~~:::~~~~~:+::,?7II~?+:=+~+I~~~~~~~~~~~~~~~~~~~~~');
        writeln('I??==~=:~~:~~::~~~==?::::~=::,?,?:+::~::?,I?=??7?:+==::::=~:7~~~~~~~~~~~~~~~~~~~');
        writeln('IIII?I,::~~=::~:~=???I::=:::::,~=::+~:~,:~:~=I+?I=+=:::=:::::++=~~~~~~~~~~~~~~~~');
        writeln('?+?IIII?II7~=~~=???~::::=:,,,:~I:+~:~:::?I7I+~=~:~:~~::~7=~:~~:I~77+~~~~~~~~~~~~');
        writeln('?I+=I+IIIII77I+===~:?::?+~~~~=~,,I+I:?+:::7++=?=?~:::I~~:~::~::I~=+I+7II777~~~~?');
        writeln('?~=7+=++?+IIII=?+=::++~+=~:::=+7?7I+++~+====~=~+.I=?I~::~?~:~I+:+::~7II~==+??77I');
        writeln('I~I?++?=+IIII7?+?~I+?7777777?+?I=?+++=++~=++==+=:===??+?7=~,~?+~~:II=+77777IIIII');
        writeln('+=7++?I?==7I?III?+?III+?=I??++=++I+++~=+~=~===+==+~=+=I+:I~=~=:7?=:77II+7I7777II');
        writeln('==I++?=?++??II==?:=?II=?=I?II?+?I====?~====++=~~~=+:=7,:::?I:?=?7I+~:~I===?77777');
        writeln('~~??++I=~+?+?I7+=I+??~+=+?????I++==++I?~=+==+=====:~+,:~~+..==I:~?~I::=:I??7I7~7');
        writeln('::::==?++??,~~7+II+=~=+=:.+~7II?=~=I?+~~~=~==+:=+==~~?::.,=~,,:?=?7I++I+?III=I?7');
        writeln('.........+:,,:I+~?+=I7==+:=+?7I7I+=:+~??:~~=+~~+==~=~=,:~==~~++??,:~7I++7?+~:~?+');
        writeln('.............:==++,+7?I=?===~?++=II=+?++?~~~~==:,=~,=~,,~,,.....~:=+?I7+:?I+???=');
        writeln('................,,,.,.,+~+::~I++,~=~=,~,+=~~~====:~=~~,=~:~~..=.~.+,,.+~?????=?~');
        writeln();
        writeln('И вот облака у твоих ног.');
        delay(DefaultDelay);
        writeln('Чувствуешь, как сладок ветер, обвевающий твое горящее лицо?');
        delay(DefaultDelay);
        writeln('Ощущаешь восторг, охватывающий изнеможденное тело, прилив бодрости и сил?');
        delay(DefaultDelay);
        writeln('Это тебе не слабенький кофеин из ближайшей кофейни, это ЭВЕРЕСТ!');
        delay(DefaultDelay);
        writeln('Ты победил! Ты смог! Ты на Вершине Мира!');
        delay(DefaultDelay);
        writeln('Кстати, как тебя зовут?');
        readln(name);
        writeln('Интересное дело, ', name, ' ... Ни один победитель не верит в случайность.');
        end
    else
    begin
        ClrScr;
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~::::');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~:::');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~::');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~:');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~~~~~=====~==~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~~========++++=+===~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~==+++++?????IIII+I?++=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~~==+++??IIIII=:+?I 7=7+I??==~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~~~~===+++++III7~+~+:=,I7++=7~~?~~=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~~=======+++?II+~~~~==::~=:==~?~:+I7?+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~~~======+++???I:~?I??I:~7,+~~+=+::+:=~7~=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('~~~=======+??IIII+III?I::==~~::=7=+7:I,I,?~~~+=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('==========+III++?+~:~+:+=?=77=III=77777++=:~:~::?~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('=======+=+?I::::::::::+,?=7++:+7:7?7::I=:~=~~~+==:~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('====+==+I?~:~:~~:::::?:~:~I~?~7 I7?+I:I~=:~:++:::=~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('===++?~:=++~+:~:~~:I::~::~:::,,+=+:==:~+::~:?:=,~:=::~~~~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('==+?+::+::~::?:~::~=:~~,:=~,:7?++~:~:=:~:~=~==:77II?=+==~~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('=?=:::~~:::::::?~::~:~~~:~I=~+?,:::+=~:~:~:::~77II7++I:~?~~~~~~~~~~~~~~~~~~~~~~~');
        writeln('I7:~:~~~:~=~:::?::~~~~?:~:~:~+:~~:::~~~~~:+::,?7II~?+:=+~+I~~~~~~~~~~~~~~~~~~~~~');
        writeln('I??==~=:~~:~~::~~~==?::::~=::,?,?:+::~::?,I?=??7?:+==::::=~:7~~~~~~~~~~~~~~~~~~~');
        writeln('IIII?I,::~~=::~:~=???I::=:::::,~=::+~:~,:~:~=I+?I=+=:::=:::::++=~~~~~~~~~~~~~~~~');
        writeln('?+?IIII?II7~=~~=???~::::=:,,,:~I:+~:~:::?I7I+~=~:~:~~::~7=~:~~:I~77+~~~~~~~~~~~~');
        writeln('?I+=I+IIIII77I+===~:?::?+~~~~=~,,I+I:?+:::7++=?=?~:::I~~:~::~::I~=+I+7II777~~~~?');
        writeln('?~=7+=++?+IIII=?+=::++~+=~:::=+7?7I+++~+====~=~+.I=?I~::~?~:~I+:+::~7II~==+??77I');
        writeln('I~I?++?=+IIII7?+?~I+?7777777?+?I=?+++=++~=++==+=:===??+?7=~,~?+~~:II=+77777IIIII');
        writeln('+=7++?I?==7I?III?+?III+?=I??++=++I+++~=+~=~===+==+~=+=I+:I~=~=:7?=:77II+7I7777II');
        writeln('==I++?=?++??II==?:=?II=?=I?II?+?I====?~====++=~~~=+:=7,:::?I:?=?7I+~:~I===?77777');
        writeln('~~??++I=~+?+?I7+=I+??~+=+?????I++==++I?~=+==+=====:~+,:~~+..==I:~?~I::=:I??7I7~7');
        writeln('::::==?++??,~~7+II+=~=+=:.+~7II?=~=I?+~~~=~==+:=+==~~?::.,=~,,:?=?7I++I+?III=I?7');
        writeln('.........+:,,:I+~?+=I7==+:=+?7I7I+=:+~??:~~=+~~+==~=~=,:~==~~++??,:~7I++7?+~:~?+');
        writeln('.............:==++,+7?I=?===~?++=II=+?++?~~~~==:,=~,=~,,~,,.....~:=+?I7+:?I+???=');
        writeln('................,,,.,.,+~+::~I++,~=~=,~,+=~~~====:~=~~,=~:~~..=.~.+,,.+~?????=?~');
        writeln();
        writeln('Посмотри, как близко была победа.');
        delay(DefaultDelay);
        writeln('Немного усилий, и облака простерлись бы у твоих ног.');
        delay(DefaultDelay);
        writeln('Быть может, ты хотел бы собраться с силами и попробовать еще раз?');
        delay(DefaultDelay);
        writeln('Что ж, Эверест будет ждать.');
    end;
readln();
end.